# SlantedColumnCannotCutEndWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlantedColumnFailures..::..SlantedColumnCannotCutEndWarn Property
BuiltInFailures..::..SlantedColumnFailures Class See Also
---
Unable to trim slanted column end geometry to desired condition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlantedColumnCannotCutEndWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlantedColumnCannotCutEndWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlantedColumnCannotCutEndWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlantedColumnFailures Class
Autodesk.Revit.DB Namespace